#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elastic_beanstalk_application.elasticapp will be created
  + resource "aws_elastic_beanstalk_application" "elasticapp" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "myapp11"
      + tags_all = (known after apply)
    }

  # aws_elastic_beanstalk_environment.beanstalkappenv will be created
  + resource "aws_elastic_beanstalk_environment" "beanstalkappenv" {
      + all_settings           = (known after apply)
      + application            = "myapp11"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "myenv"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v3.2.0 running Python 3.8"
      + tags_all               = (known after apply)
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "AssociatePublicIpAddress"
          + namespace = "aws:ec2:vpc"
          + value     = "True"
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "internet facing"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "aws-elasticbeanstalk-ec2-role"
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t2.medium"
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      + setting {
          + name      = "MatcherHTTPCode"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "200"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "2"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-0bad6a7a34eb86254,subnet-0a82bc6330cfd70fb,subnet-07cc954f55ecb7c49"
        }
      + setting {
          + name      = "SystemType"
          + namespace = "aws:elasticbeanstalk:healthreporting:system"
          + value     = "enhanced"
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-07c35abc6c735a1e9"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "Instance_type" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "minsize" but a value was
found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 1 other variable(s) defined
without being declared.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dantechoo, Action: `pull_request`*